NguyenHoangTrieu/STM32_WB55_BLE_V2/App/BLE_Gateway/Src/at_command.c
        disconnect_pending_idx = 0xFFU;
        disconnect_pending_hdl = 0xFFFFU;

        dc_ret = hci_disconnect(hdl, 0x13U);
        if (dc_ret == BLE_STATUS_SUCCESS) {
            DEBUG_INFO("Deferred disconnect OK: 0x%04X", hdl);
            /* +DISCONNECTED arrives later via HCI disconnection complete event */
        } else {
            DEBUG_INFO("Deferred disconnect 0x%02X - HCI event pending", dc_ret);
        }
        /* Send AT response for the pending AT+DISCONNECT command */
        AT_Response_Send("OK\r\n");
        return;
    }

    /* Process AT command if ready */
    if (!at_cmd_ready) {
        return;
    }

    /* Critical section: copy buffer then reset ISR state */
    __disable_irq();
    memcpy(at_cmd_buf, (const void*)at_line_buf, at_line_idx + 1);
    at_line_idx = 0;
    at_cmd_ready = 0;
    __enable_irq();

    /* Process command outside critical section */
    AT_Command_Process(at_cmd_buf);
}

/*============================================================================
 * AT Response Send (to LPUART1)
 *============================================================================*/
void AT_Response_Send(const char *fmt, ...)
{
    static char response_buf[AT_CMD_MAX_LEN];
    va_list args;
    uint16_t len;
    
    va_start(args, fmt);
    len = (uint16_t)vsnprintf(response_buf, AT_CMD_MAX_LEN, fmt, args);
    va_end(args);
    
    if (len > AT_CMD_MAX_LEN) {
        len = AT_CMD_MAX_LEN;
    }
    
    /* Send via UART - blocking */
    HAL_UART_Transmit(&hlpuart1, (uint8_t *)response_buf, len, 100);
}

/*============================================================================
 * AT Command Parser
 *============================================================================*/
void AT_Command_Process(const char *cmd_line)
{
    char cmd[AT_CMD_MAX_LEN];
    uint16_t len;
    
    if (cmd_line == NULL || cmd_line[0] == '\0') {
        return;
    }
    
    /* Copy to local buffer */
    strncpy(cmd, cmd_line, AT_CMD_MAX_LEN - 1);
    cmd[AT_CMD_MAX_LEN - 1] = '\0';
    
    /* Remove trailing whitespace/newlines */
    len = (uint16_t)strlen(cmd);
    while (len > 0 && (cmd[len-1] == '\r' || cmd[len-1] == '\n' || cmd[len-1] == ' ')) {
        cmd[--len] = '\0';
    }
    
    /* Empty command after trim */
    if (len < 2) {
        return;  /* Too short, ignore silently */
    }
    
    /* CRITICAL: Command MUST start with "AT" (case insensitive) */
    if (!((cmd[0] == 'A' || cmd[0] == 'a') && (cmd[1] == 'T' || cmd[1] == 't'))) {
        /* Invalid command - not starting with AT, likely garbage */
        DEBUG_WARN("Invalid cmd (not AT): %s", cmd);
        return;  /* Don't send ERROR, just ignore garbage */
    }
    
    /* Debug log */
    DEBUG_PRINT("AT RX: %s", cmd);
    
    /* Parse commands */
    if (strcmp(cmd, "AT") == 0) {
        AT_Response_Send("OK\r\n");
    }
    else if (strncmp(cmd, "AT+SCAN", 7) == 0) {
        uint16_t duration = 5000U;  /* Default 5s */
        if (cmd[7] == '=' && cmd[8] != '\0') {
            uint16_t parsed = ParseUInt16(&cmd[8]);
            if (parsed > 0) {
                duration = parsed;
            }
        }
        AT_SCAN_Handler(duration);
    }
    else if (strcmp(cmd, "AT+STOP") == 0) {
        /* Stop scanning */
        if (BLE_Connection_StopScan() == 0) {
            AT_Response_Send("OK\r\n");
        } else {
            AT_Response_Send("ERROR\r\n");
        }
    }
    else if (strcmp(cmd, "AT+CLEAR") == 0) {
        /* Clear device list */
        BLE_DeviceManager_Clear();
        AT_Response_Send("OK\r\n");
    }
    else if (strncmp(cmd, "AT+LIST", 7) == 0) {
        AT_LIST_Handler();
    }
    else if (strncmp(cmd, "AT+CONNECT=", 11) == 0) {
        AT_CONNECT_Handler(cmd + 11);
    }
    else if (strncmp(cmd, "AT+DISCONNECT=", 14) == 0) {
        uint8_t idx = ParseUInt8(&cmd[14]);
        if (idx != 0xFFU) {
            AT_DISCONNECT_Handler(idx);
        } else {
            AT_Response_Send("ERROR\r\n");
        }
    }
    else if (strncmp(cmd, "AT+READ=", 8) == 0) {
        const char *p = &cmd[8];
        uint8_t idx = ParseUInt8(p);
        p = SkipToComma(p);
        if (p != NULL && idx != 0xFFU) {
            uint16_t handle = ParseUInt16_Hex(p);
            if (handle > 0) {
                AT_READ_Handler(idx, handle);
            } else {
                AT_Response_Send("ERROR\r\n");
            }
        } else {
            AT_Response_Send("ERROR\r\n");
        }
    }
    else if (strncmp(cmd, "AT+WRITE=", 9) == 0) {
        /* Parse: AT+WRITE=<idx>,<handle>,<hex_data> */
        const char *p = &cmd[9];
        uint8_t idx = ParseUInt8(p);
        p = SkipToComma(p);
        if (p != NULL && idx != 0xFFU) {
            uint16_t handle = ParseUInt16_Hex(p);
            p = SkipToComma(p);
            if (p != NULL && handle > 0) {
                AT_WRITE_Handler(idx, handle, p);
            } else {
                AT_Response_Send("ERROR\r\n");
            }
        } else {
            AT_Response_Send("ERROR\r\n");
        }
    }
    else if (strncmp(cmd, "AT+NOTIFY=", 10) == 0) {
        const char *p = &cmd[10];
        uint8_t idx = ParseUInt8(p);
        p = SkipToComma(p);
        if (p != NULL && idx != 0xFFU) {
            uint16_t handle = ParseUInt16_Hex(p);
            p = SkipToComma(p);
            if (p != NULL && handle > 0) {
                uint8_t enable = ParseUInt8(p);
                if (enable != 0xFFU) {
                    AT_NOTIFY_Handler(idx, handle, enable);
                } else {
                    AT_Response_Send("ERROR\r\n");
                }
            } else {
                AT_Response_Send("ERROR\r\n");
            }
        } else {
            AT_Response_Send("ERROR\r\n");
        }
    }
    else if (strncmp(cmd, "AT+DISC=", 8) == 0) {
        uint8_t idx = ParseUInt8(&cmd[8]);
        if (idx != 0xFFU) {
            AT_DISC_Handler(idx);
        } else {
            AT_Response_Send("ERROR\r\n");
        }
    }
    else if (strncmp(cmd, "AT+CHARS=", 9) == 0) {
        /* Parse: AT+CHARS=<idx>,<start>,<end> */
        const char *p = &cmd[9];
        uint8_t idx = ParseUInt8(p);
        p = SkipToComma(p);
        if (p != NULL && idx != 0xFFU) {
            uint16_t start = ParseUInt16_Hex(p);
            p = SkipToComma(p);
            if (p != NULL && start > 0) {
                uint16_t end = ParseUInt16_Hex(p);
                if (end > 0) {
                    AT_CHARS_Handler(idx, start, end);
                } else {
                    AT_Response_Send("ERROR\r\n");
                }
            } else {
                AT_Response_Send("ERROR\r\n");
            }
        } else {
            AT_Response_Send("ERROR\r\n");
        }
    }
    else if (strncmp(cmd, "AT+DATAMODE=", 12) == 0) {
        /* Parse: AT+DATAMODE=<idx>,<handle> */
        const char *p = &cmd[12];
        uint8_t idx = ParseUInt8(p);
        p = SkipToComma(p);
        if (p != NULL && idx != 0xFFU) {
            uint16_t handle = ParseUInt16_Hex(p);
            if (handle > 0) {
                AT_DATAMODE_Handler(idx, handle);
            } else {
                AT_Response_Send("ERROR\r\n");
            }
        } else {
            AT_Response_Send("ERROR\r\n");
        }
    }
    else if (strncmp(cmd, "AT+INFO=", 8) == 0) {
        uint8_t idx = ParseUInt8(&cmd[8]);
        if (idx != 0xFFU) {
            AT_INFO_Handler(idx);
        } else {
            AT_Response_Send("ERROR\r\n");
        }
    }
    /* ============ System/Lifecycle Commands ============ */
    else if (strcmp(cmd, "AT+RESET") == 0) {
        AT_RESET_Handler();
    }
    else if (strcmp(cmd, "AT+HWRESET") == 0) {
        AT_HWRESET_Handler();
    }
    else if (strcmp(cmd, "AT+FACTORY") == 0) {
        AT_FACTORY_Handler();
    }
    /* ============ Info/Config Commands ============ */
    else if (strcmp(cmd, "AT+GETINFO") == 0) {
        AT_GETINFO_Handler();
    }
    else if (strncmp(cmd, "AT+NAME=", 8) == 0) {
        AT_NAME_Handler(&cmd[8]);
    }
    else if (strncmp(cmd, "AT+COMM=", 8) == 0) {
        /* Parse: AT+COMM=<baud>,<parity>,<stop> */
        const char *p = &cmd[8];
        uint32_t baud = (uint32_t)ParseUInt16(p);
        p = SkipToComma(p);
        if (p != NULL) {
            uint8_t parity = ParseUInt8(p);
            p = SkipToComma(p);
            if (p != NULL) {
                uint8_t stop = ParseUInt8(p);
                AT_COMM_Handler(baud, parity, stop);
            } else {
                AT_Response_Send("ERROR\r\n");
            }
        } else {
            AT_Response_Send("ERROR\r\n");
        }
    }
    else if (strncmp(cmd, "AT+RF=", 6) == 0) {
        /* Parse: AT+RF=<tx_power>,<scan_int>,<scan_win> */
        const char *p = &cmd[6];
        /* Parse as signed int for tx_power */
        int8_t tx_power = (int8_t)ParseUInt8(p);
        p = SkipToComma(p);
        if (p != NULL) {
            uint16_t scan_int = ParseUInt16(p);
            p = SkipToComma(p);
            if (p != NULL) {
                uint16_t scan_win = ParseUInt16(p);
                AT_RF_Handler(tx_power, scan_int, scan_win);
            } else {
                AT_Response_Send("ERROR\r\n");
            }
        } else {
            AT_Response_Send("ERROR\r\n");
        }
    }
    else if (strcmp(cmd, "AT+SAVE") == 0) {
        AT_SAVE_Handler();
    }
    /* ============ Mode Commands ============ */
    else if (strcmp(cmd, "AT+CMDMODE") == 0) {
        AT_CMDMODE_Handler();
    }
    else if (strncmp(cmd, "AT+DATAMODE=", 12) == 0) {
        /* Parse: AT+DATAMODE=<dev_idx>,<char_handle> */
        const char *p = &cmd[12];
        uint8_t idx = ParseUInt8(p);
        p = SkipToComma(p);
        if (p != NULL && idx != 0xFFU) {
            uint16_t handle = ParseUInt16(p);
            if (handle > 0) {
                AT_DATAMODE_Handler(idx, handle);
            } else {
                AT_Response_Send("ERROR\r\n");
            }
        } else {
            AT_Response_Send("ERROR\r\n");
        }
    }
    /* ============ Status Commands ============ */
    else if (strncmp(cmd, "AT+STATUS", 9) == 0) {
        uint8_t idx = 0xFF;  /* Default: all devices */
        if (cmd[9] == '=' && cmd[10] != '\0') {
            idx = ParseUInt8(&cmd[10]);
        }
        AT_STATUS_Handler(idx);
    }
    /* ============ Power Management Commands ============ */
    else if (strncmp(cmd, "AT+SLEEP", 8) == 0) {
        /* Parse: AT+SLEEP=<mode>,<wake_mask>,<timeout_ms> */
        uint8_t mode = 1;  /* Default: sleep mode */
        uint8_t wake_mask = 0x01;  /* Default: UART wake */
        uint32_t timeout_ms = 0;  /* Default: no timeout */
        
        if (cmd[8] == '=' && cmd[9] != '\0') {
            const char *p = &cmd[9];
            mode = ParseUInt8(p);
            p = SkipToComma(p);
            if (p != NULL) {
                wake_mask = ParseUInt8(p);
                p = SkipToComma(p);
                if (p != NULL) {
                    timeout_ms = (uint32_t)ParseUInt16(p);
                }
            }
        }
        AT_SLEEP_Handler(mode, wake_mask, timeout_ms);
    }
    else if (strcmp(cmd, "AT+WAKE") == 0) {
        AT_WAKE_Handler();
    }
    /* ============ Diagnostics Commands ============ */
    else if (strncmp(cmd, "AT+DIAG=", 8) == 0) {
        uint8_t idx = ParseUInt8(&cmd[8]);
        if (idx != 0xFFU) {
            AT_DIAG_Handler(idx);
        } else {
            AT_Response_Send("ERROR\r\n");
        }
    }
    else {
        /* Unknown AT command - log but don't spam ERROR */
        DEBUG_WARN("Unknown AT cmd: %s", cmd);
    }
}

