NguyenHoangTrieu/STM32_WB55_BLE_V2/App/BLE_Gateway/Src/at_command.c
// ==================== AT Handlers ====================

int AT_SCAN_Handler(uint16_t duration_ms)
{
    int ret;
    
    DEBUG_INFO("AT+SCAN: duration=%dms", duration_ms);
    
    ret = BLE_Connection_StartScan(duration_ms);
    if (ret != 0) {
        AT_Response_Send("ERROR\r\n");
        return -1;
    }
    
    AT_Response_Send("OK\r\n");
    return 0;
}

int AT_CONNECT_Handler(const char *idx_str)
{
    uint8_t dev_idx;
    BLE_Device_t *dev;
    int ret;
    
    /* Parse device index */
    dev_idx = ParseUInt8(idx_str);
    if (dev_idx == 0xFF) {
        AT_Response_Send("ERROR\r\n");
        return -1;
    }
    
    /* Get device from manager */
    dev = BLE_DeviceManager_GetDevice(dev_idx);
    if (dev == NULL) {
        AT_Response_Send("+ERROR:NOT_FOUND\r\n");
        return -1;
    }
    
    DEBUG_INFO("AT+CONNECT: device %d", dev_idx);
    
    /* Create connection using device MAC address */
    ret = BLE_Connection_CreateConnection(dev->mac_addr);
    if (ret != 0) {
        AT_Response_Send("ERROR\r\n");
        return -1;
    }
    
    /* OK sent immediately, +CONNECTED will follow after HCI event */
    AT_Response_Send("OK\r\n");
    return 0;
}

int AT_DISCONNECT_Handler(uint8_t dev_idx)
{
    BLE_Device_t *dev;
    int ret;

    dev = BLE_DeviceManager_GetDevice(dev_idx);
    if (dev == NULL || !dev->is_connected) {
        AT_Response_Send("+ERROR:NOT_CONNECTED\r\n");
        return -1;
    }

    DEBUG_INFO("AT+DISCONNECT: device %d, hdl=0x%04X", dev_idx, dev->conn_handle);
    if (gatt_resp_expected) {
        DEBUG_INFO("GATT pending - deferring disconnect for dev %d", dev_idx);
        disconnect_pending_idx = dev_idx;
        disconnect_pending_hdl = dev->conn_handle;
        /* No OK yet - ProcessReady will send OK when disconnect fires */
        return 0;
    }

    /* No GATT pending - disconnect immediately */
    ret = BLE_Connection_TerminateConnection(dev->conn_handle);
    if (ret != 0) {
        /* hci_disconnect failed - state already force-cleared in TerminateConnection */
        AT_Response_Send("OK\r\n");
        return 0;
    }

    /* OK sent immediately; +DISCONNECTED will follow after HCI disconnection event */
    AT_Response_Send("OK\r\n");
    return 0;
}


int AT_LIST_Handler(void)
{
    uint8_t i, count;
    BLE_Device_t *dev;
    
    DEBUG_INFO("AT+LIST");
    
    count = BLE_DeviceManager_GetCount();
    AT_Response_Send("+LIST:%d\r\n", (int)count);
    
    for (i = 0; i < count; i++) {
        dev = BLE_DeviceManager_GetDevice((int)i);
        if (dev != NULL) {
            AT_Response_Send("+DEV:%d,%02X:%02X:%02X:%02X:%02X:%02X,%d,0x%04X,%s\r\n",
                (int)i,
                dev->mac_addr[5], dev->mac_addr[4], dev->mac_addr[3],
                dev->mac_addr[2], dev->mac_addr[1], dev->mac_addr[0],
                (int)dev->rssi,
                dev->conn_handle,
                (dev->name[0] != '\0') ? dev->name : "Unknown");
        }
    }
    
    AT_Response_Send("OK\r\n");
    return 0;
}

int AT_READ_Handler(uint8_t dev_idx, uint16_t char_handle)
{
    BLE_Device_t *dev;
    int ret;
    
    dev = BLE_DeviceManager_GetDevice(dev_idx);
    if (dev == NULL || !dev->is_connected) {
        AT_Response_Send("+ERROR:NOT_CONNECTED\r\n");
        return -1;
    }
    
    DEBUG_INFO("AT+READ: dev=%d, handle=0x%04X", dev_idx, char_handle);
    
    /* Initiate read - response will come async via GATT event */
    ret = BLE_GATT_ReadCharacteristic(dev->conn_handle, char_handle);
    if (ret != 0) {
        AT_Response_Send("ERROR\r\n");
        return -1;
    }
    
    /* OK sent immediately, +READ response will follow after GATT event */
    AT_Response_Send("OK\r\n");
    return 0;
}

#define AT_WRITE_MAX_DATA_LEN  64U

int AT_WRITE_Handler(uint8_t dev_idx, uint16_t char_handle, const char *data)
{
    BLE_Device_t *dev;
    uint8_t write_buf[AT_WRITE_MAX_DATA_LEN];
    int data_len;
    int ret;
    
    dev = BLE_DeviceManager_GetDevice(dev_idx);
    if (dev == NULL || !dev->is_connected) {
        AT_Response_Send("+ERROR:NOT_CONNECTED\r\n");
        return -1;
    }
    
    if (data == NULL || data[0] == '\0') {
        AT_Response_Send("+ERROR:NO_DATA\r\n");
        return -1;
    }
    
    /* Parse hex string to bytes */
    data_len = ParseHexString(data, write_buf, AT_WRITE_MAX_DATA_LEN);
    if (data_len <= 0) {
        AT_Response_Send("+ERROR:INVALID_HEX\r\n");
        return -1;
    }
    
    DEBUG_INFO("AT+WRITE: dev=%d, handle=0x%04X, len=%d", dev_idx, char_handle, data_len);

    gatt_resp_expected = 1;
    ret = BLE_GATT_WriteCharacteristic(dev->conn_handle, char_handle, write_buf, (uint16_t)data_len);
    if (ret != 0) {
        gatt_resp_expected = 0;  /* Cancel wait - ACI call failed immediately */
        AT_Response_Send("ERROR\r\n");
        return -1;
    }

    /* No immediate response - wait for GATT proc complete event */
    return 0;
}

int AT_NOTIFY_Handler(uint8_t dev_idx, uint16_t desc_handle, uint8_t enable)
{
    BLE_Device_t *dev;
    int ret;
    
    dev = BLE_DeviceManager_GetDevice(dev_idx);
    if (dev == NULL || !dev->is_connected) {
        AT_Response_Send("+ERROR:NOT_CONNECTED\r\n");
        return -1;
    }
    
    DEBUG_INFO("AT+NOTIFY: dev=%d, handle=0x%04X, enable=%d", dev_idx, desc_handle, enable);
    uint8_t cccd_val[2];
    cccd_val[0] = enable ? 0x01U : 0x00U;
    cccd_val[1] = 0x00U;
    ret = BLE_GATT_WriteCharacteristicNoResp(dev->conn_handle, desc_handle, cccd_val, 2U);

    if (ret != 0) {
        AT_Response_Send("ERROR\r\n");
        return -1;
    }

    AT_Response_Send("OK\r\n");
    return 0;
}

int AT_DISC_Handler(uint8_t dev_idx)
{
    BLE_Device_t *dev;
    int ret;
    
    dev = BLE_DeviceManager_GetDevice(dev_idx);
    if (dev == NULL || !dev->is_connected) {
        AT_Response_Send("+ERROR:NOT_CONNECTED\r\n");
        return -1;
    }
    
    DEBUG_INFO("AT+DISC: dev=%d, hdl=0x%04X", dev_idx, dev->conn_handle);
    
    /* Start service discovery - results will come async via GATT events */
    ret = BLE_GATT_DiscoverAllServices(dev->conn_handle);
    if (ret != 0) {
        AT_Response_Send("ERROR\r\n");
        return -1;
    }
    
    /* OK sent immediately, +SERVICE responses will follow after GATT events */
    AT_Response_Send("OK\r\n");
    return 0;
}

int AT_CHARS_Handler(uint8_t dev_idx, uint16_t start_handle, uint16_t end_handle)
{
    BLE_Device_t *dev;
    int ret;
    
    dev = BLE_DeviceManager_GetDevice(dev_idx);
    if (dev == NULL || !dev->is_connected) {
        AT_Response_Send("+ERROR:NOT_CONNECTED\r\n");
        return -1;
    }
    
