NguyenHoangTrieu/STM32_WB55_BLE_V2/App/BLE_Gateway/Src/at_command.c
    AT_Response_Send("OK\r\n");
    return 0;
}

// ==================== Power Management Handlers ====================

int AT_SLEEP_Handler(uint8_t mode, uint8_t wake_mask, uint32_t timeout_ms)
{
    Power_Mode_t power_mode;
    
    DEBUG_INFO("AT+SLEEP: mode=%d, wake=0x%02X, timeout=%lu", 
               mode, wake_mask, timeout_ms);
    
    /* Validate mode */
    if (mode < 1 || mode > 4) {
        AT_Response_Send("+ERROR:INVALID_MODE\r\n");
        return -1;
    }
    
    power_mode = (Power_Mode_t)mode;
    
    AT_Response_Send("OK\r\n");
    HAL_Delay(50);  /* Allow UART transmission to complete */
    
    /* Enter sleep */
    Module_Power_EnterSleep(power_mode, wake_mask, timeout_ms);
    
    /* After wake - send wake event */
    AT_Response_Send("+WAKE\r\n");
    
    return 0;
}

int AT_WAKE_Handler(void)
{
    /* Manual wake command (always succeeds in run mode) */
    DEBUG_INFO("AT+WAKE");
    AT_Response_Send("OK\r\n");
    return 0;
}

// ==================== Diagnostics Handlers ====================

int AT_DIAG_Handler(uint8_t dev_idx)
{
    BLE_Device_t *dev;
    
    DEBUG_INFO("AT+DIAG: dev=%d", dev_idx);
    
    dev = BLE_DeviceManager_GetDevice(dev_idx);
    if (dev == NULL) {
        AT_Response_Send("ERROR\r\n");
        return -1;
    }
    
    /* Report diagnostics */
    AT_Response_Send("+DIAG:RSSI=%d dBm\r\n", (int)dev->rssi);
    
    if (dev->is_connected) {
        AT_Response_Send("+DIAG:CONN_HANDLE=0x%04X\r\n", dev->conn_handle);
        AT_Response_Send("+DIAG:STATUS=CONNECTED\r\n");
    } else {
        AT_Response_Send("+DIAG:STATUS=DISCONNECTED\r\n");
    }
    
    /* Add more diagnostic info as needed */
    const RF_Config_t *rf_config = &(Module_Config_Get()->rf);
    AT_Response_Send("+DIAG:TX_POWER=%d dBm\r\n", (int)rf_config->tx_power_dbm);
    
    AT_Response_Send("OK\r\n");
    return 0;
}
